class TypeA {
    constructor(imgSrc,introTitle,corporation,appType,details) {
        this.imgSrc = imgSrc;
        this.introTitle=introTitle;
        this.corporation=corporation;
        this.appType=appType;
        this.details=details;
    }
}
let typeAData = [];
typeAData[0] = new TypeA( '../img/崩坏3.png', '崩坏3', '上海米哈游影铁科技有限公司', ['ACG', 'ARPG', '二次元', '美少女', '经典佳作'], '《崩坏3》——点燃国创动作游戏之魂！<br>\n' +
    '3D全视角卡通渲染、无限可能的分支连招，酣畅淋漓的超强打击感……打造次世代动作游戏！<br>\n' +
    '扣人心弦的崩坏系列故事、沉浸感十足的关卡剧情、豪华的声优阵容，更会让你感受到前所未有的代入感。<br>\n' +
    '与个性鲜明的女武神们朝夕相处，她们的羁绊将会成为你战斗的力量！<br><br>\n' +
    '休伯利安号指挥系统已准备就绪，正在处理登录请求…校验完毕！<br>\n' +
    '全舰听令，防护栓解锁，下载引擎开始输送高浓度能量，登录倒计时10,9,8…<br><br>\n' +
    '「Captain on the bridge.」<br>\n' +
    '从今天起，你就是我们的舰长了。<br>\n' +
    '请和我们一起，为世界上所有的美好而战吧！');
typeAData[1] = new TypeA('../img/元梦之星LOGO.png', '元梦之星(正版合家欢游戏)', '深圳市腾讯计算机系统有限公司', ['派对游戏', '休闲', '卡通', '多人在线', '自由创作'], '《元梦之星》是一款人手必备的正版合家欢派对游戏！i人e人都能玩，化身百变星宝，组队整活一起嗨！随时随地，打开一场轻松狂欢！<br><br>' +
    '该游戏由腾讯天美工作室群研发，腾讯天游科技有限公司运营的手机游戏，于2023年12月15日公测。游戏中玩家可以使用多种装扮，和好友们挑战排位、积分、生存、竞速等玩法。<br><br>' +
    '欢迎来到超开星乐园，进入乐园，变身星宝，到广场随时和超热情的星朋友笑作一团，摇摇尾巴、招招手就能快乐通电。<br>' +
    '这里是无限大的游乐场，神奇场景应有尽有，夏日水道、巨石阵、空中管道，去放肆胡闹闯关吧。或者和星宝们来一场激烈对决。去丛林欢乐射击、到擂台软萌混战，用头槌淘汰对手。如果玩家有更多“开星”脑洞，可以加入乐园神秘组织，DIY星世界地图。\n');
typeAData[2] = new TypeA('../img/爱奇艺LOGO.png', '爱奇艺', '北京爱奇艺科技有限公司', ['播放器', '长视频', '视频播放'], '【独播热播 给你想要】<br>'+
    '精彩戏剧实时看：三大队、一念关山、鲲鹏击浪、宁安如梦、凶案深处、莲花楼、一闪一闪亮星星、狂飙、无所畏惧、田耕纪、云之羽、卿卿日常、琅琊榜、长风渡<br>'+
    '热播电影不间断：拯救嫌疑人、斗破苍穹：止戈、我爸没说的那件事、前任4：英年早婚、坚如磐石、志愿军：雄兵出击、好像也没那么热血沸腾、阿凡达：水之道<br>'+
    '热门综艺看不停：势不可挡、你好种地少年、王牌对王牌第8季、奔跑吧生态篇、家务优等生、种地吧、一年一度喜剧大赛、来活了兄弟、我们的歌第5季、哈哈哈哈哈第3季<br>'+
    '动漫番剧随心换：航海王、逆天邪神3D、大主宰年番、深渊游戏、咒术回战、逆天邪神、有药 第2季、万古神话、精灵梦叶罗丽 第10季、万界至尊、间谍过家家 第2季<br>'+
    '海外剧集尽情选：请回答1988、经常请吃饭的漂亮姐姐、金秘书为何那样、大力女子都奉顺、老友记、风骚律师、哥谭镇、明日传奇、小谢尔顿<br><br>'+
    '【VIP会员 尊享特权】<br>'+
    '1、内容特权：院线新片、海量高分大片、热剧抢先看、付费影片折扣、畅读小说。<br>'+
    '2、观影特权：广告特权、1080P、帧绮映画、杜比全景声、杜比视界、爱奇艺音效、音频模式、专属弹幕、视频加长截取、下载加速、并行下载、边下边播、预约下载、亲子特权。<br>'+
    '3、身份特权：星钻VIP会员七端全屏通、星钻VIP会员畅享多会员、尊贵标识、尊享装扮、生日礼包、专属客服、等级权益红包、赠送好友影片、好友免费一起看。<br>'+
    '4、生活特权：每日福利、黄金会员免费领、FUN会员免费领、体育会员免费领、电视会员免费领、投屏设备优惠');
typeAData[3] = new TypeA('../img/腾讯视频LOGO.png', '腾讯视频', '腾讯科技（北京）有限公司', ['播放器', '长视频', '视频播放'], '【精彩内容，现在就要】<br>'+
    '《我知道我爱你》天大地大喜欢最大！张晚意孙怡直面爱情本能<br>'+
    '《斗破苍穹之少年归来》莫欺少年穷，萧炎薰儿热血再战斗气大陆！<br>'+
    '《黑土无言》X剧场新作，陈建斌胡军邓家佳极限博弈撬开真相<br>'+
    '《毛雪汪》葛优综艺首秀！冯小刚回忆与葛优初相识场景；宋轶聊《庆余年2》，剧透张若昀郭麒麟变化大。<br>'+
    '《一路前行》胡歌爆笑开拖拉机除草，刘涛陈龙农场做饭馋哭了！<br>'+
    '《邻家诗话 第5季》浣纱溪畔，再现西施响屧舞，方锦龙傅希如联袂演绎绝美元曲。<br>'+
'   《乐在旅途》苏运莹加盟武汉之旅，再秀惊艳高音。希林热血演唱《追梦赤子心》，大合唱《长江之歌》超感人。<br>'+
    '《前任4：英年早婚》经典爱情IP续作！韩庚郑恺领衔全员回归<br>'+
    '《莫斯科行动》警匪对峙！刘德华张涵予黄轩硬核较量<br>'+
    '《河边的错误》朱一龙发疯刑警破凶案<br>'+
    '《蜘蛛侠：纵横宇宙》百蛛集结，燃爆多元宇宙！<br>'+
    '《大王饶命2》灵气复苏，和重要的人一起变强吧！<br>'+
    '《武双姝》正在热播，两大红颜执戟，用己身守护一方安宁！<br>'+
    '《西行纪年番》大悟空回归，大战白骨骷髅国<br>'+
    '《何以中国》： 大型史诗纪录片！跟随考古学家的脚步，探寻中华文明之源');
typeAData[4] = new TypeA('../img/CSDNLOGO.png', 'CSDN', '北京创新乐知网络技术有限公司', ['社区', '聊天', '编程学习'], 'CSDN-专业技术平台。成就一亿技术人，成为技术人交流与成长的家园。 通过CSDN技术社区，你可以了解到最新的技术开发信息解决方案和编程学习教程。<br><br>'+
    '【程序员写作】<br>'+
    'CSDN是国内领先的程序员技术创作社区，程序员可以创作分享各类计算机IT技术领域知识资讯<br>'+
    '主要技术方向:包含人工智能、移动开发、 编程语言、研发管理、运维、云计算/大数据、数据库、游戏开发、web前端、物联网、计算机基础、安全、区块链、音视频发、技术开发架构、Linux、儿童编程、爬虫、云服务器、软件测试前沿技术学习等。<br><br>'+
    '【程序员问答】<br>'+
    '解决程序员工作学习中遇到的问题，各类技术领域专家及大牛专业解答，所有技术疑问都能在CSDN找到可被信赖的解答。汇聚中文IT技术社区知识分享者，有问必答。<br><br>'+
    '【程序员直播】<br>'+
    '在CSDN，你能看到：各领域编程语言教程在线直播<br>'+
    '覆盖HTML5/Python/CSS/JavaScript/jQuery/C/PHP/Java/Sql/Mysql/r语言/易语言/php/c#/.net等编程语言学习文档手册和IT程序员面试经验，致力于帮助自学电脑编程或初学者入门编程来提升程序员实战编程能力。<br><br>'+
    '【程序员专栏】<br>'+
    'CSDN专栏，为你精选选好内容。<br>'+
    '海量精品专栏和视频<br>'+
    '《如何从零学习React技术》《Python全栈60天精通之路》《Git：Github入味》《算法设计实战50讲》《深入浅出Docker技术栈实践课》《webpack前端工程化入门》《机器学习极简入门》《精通sping boot42讲》《阿里巴巴云原生技术公开课》等');
typeAData[5] = new TypeA('../img/蛋仔派对LOGO.png', '蛋仔派对', '杭州网易雷火科技有限公司', ['派对游戏', '休闲', '卡通','编辑推荐','年度新游'], '注意啦！你已进入盲盒世界，萌蛋来袭，派对开启！<br><br>'+
    '《蛋仔派对》是一款潮玩题材的休闲竞技手游，在这里你将化身Q萌蛋仔，加入热闹非凡的闯关派对。让我们一起撞走不开心，结交好碰友！<br><br>'+
    '海量关卡，陷阱机关，争先恐后往前冲！奔跑、跳跃、翻滚，发生超真实的物理碰撞！<br><br></br>'+
    '百变外观任你搭配，潮流、酷炫、萌趣的盲盒等你收入囊中！更有零门槛地图编辑器，DIY你的专属关卡！');
typeAData[6] = new TypeA('../img/抖音LOGO.png', '抖音', '北京微播视界科技有限公司', ['短视频', '视频播放', 'AR'], '抖音是一个帮助用户表达自我，记录美好生活的短视频平台。<br><br>'+
    '<b>记录美好在抖音</b><br>'+
    '智能匹配音乐、一键卡点视频，还有超多原创特殊效果、滤镜、场景切换帮你一秒变大片，让你的生活轻松记录在抖音！<br><br></br>'+
    '<b>实用内容在抖音</b><br>'+
    '生活妙招、美食做法、旅行攻略、科技知识、新闻时事、同城资讯，你需要的实用内容都在抖音！<br><br>'+
    '<b>各行各业在抖音</b><br>'+
    '原创音乐人、京剧演员、中国科学院教授、非遗传承人、烧烤摊老板、快递小哥等，每个人真实的生活都在抖音！<br><br>'+
    '全民记录自我，生活的美好都在这里！');
typeAData[7] = new TypeA('../img/淘宝LOGO.png', '淘宝', '浙江淘宝网络有限公司', ['综合商城', '在线商城', '时尚购物','AR'], '淘宝是一个好逛、丰富、有趣的消费生活社区，每天有亿万消费者来淘宝“逛街”：发现好物、找到乐趣、表达体验……淘宝能满足人们生活中的各种需求：搜索和浏览商品、加入购物车、下单支付、物流查询、客服交流、发表购物评论、分享优质商品等等，还能通过本地功能，找到附近的生活优惠信息。<br><br>'+
    '淘宝好逛，是因为——<br><br>'+
    '1、在淘宝上，找到最丰富的商品：<br>'+
    '各种各样的优质好物、神奇商品都在淘宝上。<br>'+
    '再小的需求，也能在淘宝上被满足；再小的爱好，也能在淘宝上找到同好。<br><br>'+
    '2、在淘宝上，获得最好逛的体验<br>'+
    '淘宝每天都会推荐优质、有趣的商品、服务和优惠信息。<br>'+
    '每个人都能在这里找到自己感兴趣的商品，足不出户就能逛到好物。<br><br>'+
    '3、在淘宝上，看到最真实的内容：<br>'+
    '淘宝直播间里的实物展示、评论区里真实的买家秀，让人买起来更放心。<br>'+
    '人们也能在淘宝“逛逛”社区分享自己的购物体验、推荐优质商品。<br><br>'+
    '4、在淘宝上，买到最优惠的商品：<br>'+
    '每年双11、618等大促活动，商家集体打折，人们能在淘宝上获得真正的实惠。<br>'+
    '同时，成为88VIP会员和品牌会员，还能享受更多福利。<br>')
function displayAPP() {
    // 获取 URL 中的参数
    const urlParams = new URLSearchParams(window.location.search);
    const appIdString = urlParams.get('appId');
    const appId = parseInt(appIdString, 10);

    // 检查 appId 是否有效
    if (!isNaN(appId) && appId >= 0 && appId < typeAData.length) {
        // 获取元素
        const img = document.getElementById("infoIMG");
        const title = document.querySelector(".IntroTitle");
        const cor = document.querySelector(".IntroCor");
        const appType = document.querySelectorAll(".APPType");
        const detail = document.querySelector(".appDetail");

        // 设置元素内容
        img.src = typeAData[appId].imgSrc;
        title.innerText = typeAData[appId].introTitle;
        cor.innerHTML = typeAData[appId].corporation;

        // 设置 APPType 元素内容
        for (let i = 0; i < appType.length; i++) {
            appType[i].innerHTML = typeAData[appId].appType[i] || ''; // 防止数组越界
        }

        // 设置详情元素内容
        detail.innerHTML = typeAData[appId].details;
    } else {
        console.error('无效的 appId。');
    }
    checkUser();
}
document.addEventListener('DOMContentLoaded', displayAPP);
